app/controllers/api/stories_controller.rb

    def index

        if params[:user_id]
            @user = User.find(params[:user_id])
            @stories = @user.stories
            render 'api/stories/userIndex'
        else
            @stories = Story.all.includes(:author)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
SELECT "stories".* FROM "stories" WHERE "stories"."author_id" = $1  [["author_id", 58]]

    def create
        @story = Story.new(story_params)
        @story.author_id = current_user.id
        @user = User.find(current_user.id)
        if @story.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 66], ["LIMIT", 1]]
INSERT INTO "stories" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hey now"], ["body", "hey now"], ["author_id", 66], ["created_at", "2019-08-04 17:24:11.372108"], ["updated_at", "2019-08-04 17:24:11.372108"]]

    def update
        @story = Story.find(params[:id])
        @user = User.find(@story.author_id)
        if @story.update(story_params)
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 111], ["LIMIT", 1]]
UPDATE "stories" SET "title" = $1, "updated_at" = $2 WHERE "stories"."id" = $3  [["title", "That was the best ice-cream I ever tasted."], ["updated_at", "2019-08-04 19:48:30.119325"], ["id", 82]]