app/views/api/stories/_story.json.jbuilder

INSERT INTO "stories" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Story 1 "], ["body", "publish story"], ["author_id", 8], ["created_at", "2019-08-02 20:03:15.422413"], ["updated_at", "2019-08-02 20:03:15.422413"]]
---
json.extract! story, :id, :title, :body, :author_id
json.date story.created_at.strftime('%b %d, %Y')